app/controllers/items_controller.rb

INSERT INTO "items" ("title", "description", "price", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Kettle mod"], ["description", "SMTH more then tea"], ["price", 859.68], ["created_at", 2017-02-15 01:37:15 UTC], ["updated_at", 2017-02-15 01:37:15 UTC], ["image", "самогонний.jpg"]]
---
  def create
    @item = Item.new(item_params)
    unless @item.save

UPDATE "items" SET "title" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "Kettle updete"], ["price", 23.67], ["updated_at", 2017-02-14 20:45:51 UTC], ["id", 2]]
---
  def update
    if @item.update_attributes(item_params)